var dataSource = require("../datasource")
const Child = require("../entities/Child");
const Group = require("../entities/Group");
const HobbyGroup = require("../entities/HobbyGroup");
const Journal = require("../entities/Journal");
const Parent = require("../entities/Parent");
const Teacher = require("../entities/Teacher");

module.exports = class SeedingDb1715439353814 {

    async up(queryRunner) {

        await queryRunner.query('DELETE FROM `groups`;');
        await queryRunner.query(`DELETE FROM teachers;`);
        await queryRunner.query(`DELETE FROM journal;`);
        await queryRunner.query(`DELETE FROM parents;`);
        await queryRunner.query(`DELETE FROM hobbygroups_childrens_childrens;`);
        await queryRunner.query(`DELETE FROM childrens;`);
        await queryRunner.query(`DELETE FROM hobbygroups;`);

        await queryRunner.query(`
        INSERT INTO teachers (name,salary,phone)
        VALUES 
        ('Василь Петрович Громенко', 9450, '+380668592664'),
        ('Ірина Ігорівна Зелена',9200,'+380934041338'),
        ('Вікторія Миколаївна Харченко',10200,'+380993981125'),
        ('Олексій Григорович Шумій',9600,'+380507477882');`);

        await queryRunner.query(`
        INSERT INTO hobbygroups (title,time)
        VALUES 
        ('Кружок легкої атлетики', '17:00'),
        ('Кружок англійскої мови', '16:00'),
        ('Кружок юних хіміків','16:30');`);

        const teachers = await queryRunner.query(`SELECT * FROM teachers`);
        await queryRunner.query('INSERT INTO `groups` (cabinet, title, teacherId) VALUES (101, "Соняшник", ?),(102, "Веселі казкові персонажі", ?),(103, "Дракончики", ?),(104, "Маленькі майстри", ?)', 
        [teachers[0].id, teachers[1].id, teachers[2].id, teachers[3].id]);
        const groups = await queryRunner.query('SELECT * FROM `groups`');
        await queryRunner.query("INSERT INTO `childrens` (`name`,`description`,`birthDate`,`groupsId`,`lockerNum`) VALUES ('Олексій Іванович Ковальчук','Алергій нема.','2020-02-11',?,1), ('Марія Петрівна Даниленко','Алергія на кисломолочні продукти.','2020-06-11',?,2), ('Олександра Андріївна Степаненко','Алергій нема.','2020-03-11',?,3), ('Владислава Вікторівна Петренко','Алергія на цитрусові.','2019-06-19',?,4), ('Максим Олегович Коваленко','Алергій нема.','2019-11-19',?,5), ('Анна Сергіївна Мельник','Алергій нема.','2019-07-19',?,6), ('Євгенія Олексіївна Грищенко','Алергія на кисломолочні продукти.','2019-04-19',?,7), ('Данило Юрійович Кравченко','Алергія на цитрусові.','2020-06-01',?,8), ('Софія Ігорівна Романенко','Алергій нема.','2020-08-05',?,9), ('Артем Михайлович Литвиненко','Алергій нема.','2020-05-22',?,10), ('Вікторія Павлівна Кириленко','Алергій нема.','2020-03-21',?,11), ('Олег Вікторович Стельмах','Алергій нема.','2020-06-13',?,12), ('Єлизавета Анатоліївна Пономаренко','Алергій нема.','2020-07-09',?,13), ('Артемій Валерійович Морозенко','Алегрій нема.','2020-08-15',?,14), ('Юлія Василівна Ткаченко','Алергія на кисломолочні продукти.','2019-04-04',?,15), ('Олександр Петрович Гончаренко','Алергій нема.','2019-04-01',?,16), ('Анастасія Іванівна Лисенко','Алергій нема.','2019-04-02',?,17), ('Віктор Вадимович Попов','Алергій нема.','2019-04-22',?,18), ('Софія Ярославівна Білоус','Алергій нема.','2019-04-23',?,19), ('Іван Ігорович Кузьменко','Алергій нема.','2019-04-25',?,20), ('Марта Віталіївна Савченко','Алергія на цитрусові.','2019-04-11',?,21), ('Дмитро Олексійович Григоренко','Алергій нема.','2019-04-17',?,22), ('Вікторія Степанівна Федоренко','Алергій нема.','2019-04-09',?,23)",[
            groups[0].id,
            groups[0].id,
            groups[0].id,
            groups[1].id,
            groups[1].id,
            groups[1].id,
            groups[1].id,
            groups[2].id,
            groups[2].id,
            groups[2].id,
            groups[2].id,
            groups[2].id,
            groups[2].id,
            groups[2].id,
            groups[3].id,
            groups[3].id,
            groups[3].id,
            groups[3].id,
            groups[3].id,
            groups[3].id,
            groups[3].id,
            groups[3].id,
            groups[3].id
        ])
        const childrens = await queryRunner.query('SELECT * FROM childrens');
        await queryRunner.query("INSERT INTO parents (name,job,sex,phone,childrensId) VALUES ('Ірина Володимирівна Ковальчук','Вчитель','жінка','+380123456789',?), ('Іван Олександрович Ковальчук','Інженер','чоловік','+380987654321',?), ('Ольга Михайлівна Даниленко','Фармацевтка','жінка','+380123456789',?), ('Петро Васильович Даниленко','Адвокат','чоловік','+380987654321',?), ('Наталія Ігорівна Степаненко','Медсестра','жінка','+380123456789',?), ('Андрій Миколайович Степаненко','Архітектор','чоловік','+380987654321',?), ('Тетяна Олександрівна Петренко','Бухгалтер','жінка','+380123456789',?), ('Віктор Іванович Петренко','Менеджер з продажу','чоловік','+380987654321',?), ('Анастасія Сергіївна Коваленко','Лікарка','жінка','+380123456789',?), ('Олег Віталійович Коваленко','ІТ-спеціаліст','чоловік','+380987654321',?), ('Наталія Володимирівна Мельник','Медсестра','жінка','+380123456789',?), ('Сергій Олександрович Мельник','Архітектор','чоловік','+380987654321',?), ('Тетяна Володимирівна Грищенко','Бухгалтер','жінка','+380123456789',?), ('Олексій Олександрович Грищенко','Менеджер з продажу','чоловік','+380987654321',?), ('Тетяна Володимирівна Кравченко','Інженер','жінка','+380123456789',?), ('Юрій Олександрович Кравченко','Адвокат','чоловік','+380987654321',?), ('Ольга Володимирівна Романенко','ІТ-спеціаліст','жінка','+380123456789',?), ('Ігор Олександрович Романенко','Інженер','чоловік','+380987654321',?), ('Наталія Володимирівна Литвиненко','Вчитель','жінка','+380123456789',?), ('Михайло Олександрович Литвиненко','Адвокат','чоловік','+380987654321',?), ('Анастасія Володимирівна Кириленко','Вчитель','жінка','+380123456789',?), ('Павло Олександрович Кириленко','Інженер','чоловік','+380987654321',?), ('Ірина Володимирівна Стельмах','ІТ-спеціаліст','жінка','+380123456789',?), ('Віктор Олександрович Стельмах','Адвокат','чоловік','+380987654321',?), ('Анастасія Володимирівна Пономаренко','Вчитель','жінка','+380123456789',?), ('Анатолій Олександрович Пономаренко','Архітектор','чоловік','+380987654321',?), ('Тетяна Володимирівна Морозенко','Медсестра','жінка','+380123456789',?), ('Валерій Олександрович Морозенко','Адвокат','чоловік','+380987654321',?), ('Тетяна Володимирівна Ткаченко','Вчитель','жінка','+380123456789',?), ('Василь Олександрович Ткаченко','Інженер','чоловік','+380987654321',?), ('Ірина Володимирівна Гончаренко','Бухгалтер','жінка','+380123456789',?), ('Петро Олександрович Гончаренко','Менеджер з продажу','чоловік','+380987654321',?), ('Наталія Володимирівна Лисенко','Вчитель','жінка','+380123456789',?), ('Іван Олександрович Лисенко','Інженер','чоловік','+380987654321',?), ('Анастасія Володимирівна Попов','ІТ-спеціаліст','жінка','+380123456789',?), ('Вадим Олександрович Попов','Архітектор','чоловік','+380987654321',?), ('Ірина Володимирівна Білоус','Інженер','жінка','+380123456789',?), ('Ярослав Олександрович Білоус','Менеджер з продажу','чоловік','+380987654321',?), ('Тетяна Володимирівна Кузьменко','Бухгалтер','жінка','+380123456789',?), ('Ігор Олександрович Кузьменко','Архітектор','чоловік','+380987654321',?), ('Ольга Володимирівна Савченко','Вчитель','жінка','+380123456789',?), ('Віталій Олександрович Савченко','Бухгалтер','чоловік','+380987654321',?), ('Ірина Володимирівна Григоренко','Бухгалтер','жінка','+380123456789',?), ('Олексій Олександрович Григоренко','Інженер','чоловік','+380987654321',?), ('Анастасія Володимирівна Федоренко','ІТ-спеціаліст','жінка','+380123456789',?), ('Степан Олександрович Федоренко','Бухгалтер','чоловік','+380987654321',?) ",[
            childrens[0].id,
            childrens[0].id,
            childrens[1].id,
            childrens[1].id,
            childrens[2].id,
            childrens[2].id,
            childrens[3].id,
            childrens[3].id,
            childrens[4].id,
            childrens[4].id,
            childrens[5].id,
            childrens[5].id,
            childrens[6].id,
            childrens[6].id,
            childrens[7].id,
            childrens[7].id,
            childrens[8].id,
            childrens[8].id,
            childrens[9].id,
            childrens[9].id,
            childrens[10].id,
            childrens[10].id,
            childrens[11].id,
            childrens[11].id,
            childrens[12].id,
            childrens[12].id,
            childrens[13].id,
            childrens[13].id,
            childrens[14].id,
            childrens[14].id,
            childrens[15].id,
            childrens[15].id,
            childrens[16].id,
            childrens[16].id,
            childrens[17].id,
            childrens[17].id,
            childrens[18].id,
            childrens[18].id,
            childrens[19].id,
            childrens[19].id,
            childrens[20].id,
            childrens[20].id,
            childrens[21].id,
            childrens[21].id,
            childrens[22].id,
            childrens[22].id
        ])
        

    }

    async down(queryRunner) {
        await queryRunner.query('DELETE FROM `groups`;');
        await queryRunner.query(`DELETE FROM teachers;`);
        await queryRunner.query(`DELETE FROM childrens;`);
        await queryRunner.query(`DELETE FROM hobbygroups;`);
        await queryRunner.query(`DELETE FROM hobbygroups_childrens_childrens;`);
        await queryRunner.query(`DELETE FROM journal;`);
        await queryRunner.query(`DELETE FROM parents;`);
    }

};